HELYXcore-4.4.0/examples/legacy/compressible/rhoPimpleFoam/RAS/mixerVessel2D/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

./makeMesh
runApplication $(getApplication)

#------------------------------------------------------------------------------
